tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/homebrew-services"

brew "git"
brew "curl"
brew "docker"
brew "lv"
brew "imagemagick"
brew "rbenv"
brew "ruby-build"
brew "postgresql@15"
brew "fish"
brew "nodenv"
brew "node-build"

cask_args appdir: "/Applications"
cask "iterm2"
cask "visual-studio-code"
cask "google-chrome"
cask "slack"
